balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB110.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR9" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR9" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0x3f" edc:name="RP18R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0x3f" edc:name="RP19R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP18R0" edc:desc="" edc:mask="0x1" edc:name="RP18R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R1" edc:desc="" edc:mask="0x1" edc:name="RP18R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R2" edc:desc="" edc:mask="0x1" edc:name="RP18R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R3" edc:desc="" edc:mask="0x1" edc:name="RP18R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R4" edc:desc="" edc:mask="0x1" edc:name="RP18R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R5" edc:desc="" edc:mask="0x1" edc:name="RP18R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP19R0" edc:desc="" edc:mask="0x1" edc:name="RP19R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R1" edc:desc="" edc:mask="0x1" edc:name="RP19R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R2" edc:desc="" edc:mask="0x1" edc:name="RP19R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R3" edc:desc="" edc:mask="0x1" edc:name="RP19R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R4" edc:desc="" edc:mask="0x1" edc:name="RP19R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R5" edc:desc="" edc:mask="0x1" edc:name="RP19R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR10" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR10" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP20R" edc:desc="" edc:mask="0x3f" edc:name="RP20R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP21R" edc:desc="" edc:mask="0x3f" edc:name="RP21R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP20R0" edc:desc="" edc:mask="0x1" edc:name="RP20R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R1" edc:desc="" edc:mask="0x1" edc:name="RP20R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R2" edc:desc="" edc:mask="0x1" edc:name="RP20R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R3" edc:desc="" edc:mask="0x1" edc:name="RP20R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R4" edc:desc="" edc:mask="0x1" edc:name="RP20R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R5" edc:desc="" edc:mask="0x1" edc:name="RP20R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP21R0" edc:desc="" edc:mask="0x1" edc:name="RP21R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R1" edc:desc="" edc:mask="0x1" edc:name="RP21R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R2" edc:desc="" edc:mask="0x1" edc:name="RP21R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R3" edc:desc="" edc:mask="0x1" edc:name="RP21R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R4" edc:desc="" edc:mask="0x1" edc:name="RP21R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R5" edc:desc="" edc:mask="0x1" edc:name="RP21R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR11" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR11" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP22R" edc:desc="" edc:mask="0x3f" edc:name="RP22R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP23R" edc:desc="" edc:mask="0x3f" edc:name="RP23R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP22R0" edc:desc="" edc:mask="0x1" edc:name="RP22R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R1" edc:desc="" edc:mask="0x1" edc:name="RP22R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R2" edc:desc="" edc:mask="0x1" edc:name="RP22R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R3" edc:desc="" edc:mask="0x1" edc:name="RP22R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R4" edc:desc="" edc:mask="0x1" edc:name="RP22R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R5" edc:desc="" edc:mask="0x1" edc:name="RP22R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP23R0" edc:desc="" edc:mask="0x1" edc:name="RP23R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R1" edc:desc="" edc:mask="0x1" edc:name="RP23R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R2" edc:desc="" edc:mask="0x1" edc:name="RP23R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R3" edc:desc="" edc:mask="0x1" edc:name="RP23R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R4" edc:desc="" edc:mask="0x1" edc:name="RP23R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R5" edc:desc="" edc:mask="0x1" edc:name="RP23R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
